app/controllers/trails_controller.rb

SELECT "trails".* FROM "trails"
SELECT  "trails".* FROM "trails" WHERE "trails"."name" = $1 LIMIT 1  [["name", "Tennessee Valley Trail"]]
---
  def index
    @trails = Trail.all

    if request.xhr?
      if params[:pace] == "0" || params[:weight] == "0" || params[:trailName] == "Trails Dropdown\n  "
        flash[:error] = "Please select a trail, set hiking pace, and/or adjust weight"
      else
        trail_data = Trail.find_by(name: params[:trailName])

SELECT  "trails".* FROM "trails" WHERE "trails"."name" = $1 AND "trails"."distance" = $2 AND "trails"."elevation_gain" = $3 LIMIT 1  [["name", "Tennessee Valley Trail"], ["distance", "5487.8494"], ["elevation_gain", "39.9288"]]
---
  def create
    name = params[:name]
    distance = params[:trailGeoStats][:length]
    elevation_gain = params[:trailGeoStats][:elevationGain]
    trail = Trail.find_or_initialize_by(name: name, distance: distance, elevation_gain: elevation_gain)